using System;
using System.Collections.Generic;
using System.Text;

namespace GlassRobot
{
    public class Var
    {
        //================================================常量定义=====================================================

        //路径常数
        public const string GtsDll = @"\Hard Disk\GlassRobot\GTS.dll";
        public const string userPath = @"\Hard Disk\GlassRobot\User.crd";
        public const string toolPath = @"\Hard Disk\GlassRobot\Tool.crd";
        public const string JobPath = @"\Hard Disk\GlassRobot\Job\";
        public const string FilePath = @"\Hard Disk\GlassRobot\";
        public const string HelpPath = "\\Hard Disk\\GlassRobot\\help\\EMThelp.html";
        public const string UPath = @"\Hard Disk\USB Disk\";//调试暂用

        //枚举类别定义==================================================================================================
        public enum Page { File, Key, IO, RunAuto, RunManu, Robot, CountInfo, ErrInfo, SysInfo, BackUp };  //当前页面
        public enum CurrentManipulator { Robot, Robot1, Robot2, Base, Extend };  //当前操作对象
        public enum ManuSpeed { Inc, Low, Middle, High };  //手动速度档次
        public const double speedI = 0.01, speedL = 0.05, speedM = 0.1, speedH = 0.3;
        public enum CurrentMode { Teach, Play, Remote };  //指示当前模式，示教、自动、远程
        public enum PlayMode { Auto, Cycle, Step };  //指示当前方式，自动循环、一个周期、步进
        public enum CompileMode {Run,RunTest,Logic,Forward,Backward };
        public enum CurrentStatus { Run, Pause, Stop };  //当前机器状态
        public enum JogDir { XP, XN, YP, YN, ZP, ZN, xP, xN, yP, yN, zP, zN };  //JogJoint运动的轴，P+，N-
        public enum MovType { None, PVT, PT, JOG, ManuLine, HOME };  //运动方式，None运动执行中或空闲(不接受新指令），PVT规划运动，PT固高自己的PT（无柔性加减速），JOG，ManuLine手动直线（目标不定），HOME归零（复杂逻辑）

  //===========================================================定义错误代码和内容====================================================================
        
        //控制器及运动错误代码和内容
        public static string[] errMsgofMotion = new string[]
        {
            "一切正常",  //0
            "打开控制器失败，请重新启动", //1
            "控制器重置失败，请重新启动", //2
            "控制器配置失败，请确认GlassRobot下的GTS800文件", //3
            "清除驱动器报警或限位失败，请检查驱动器报警信息", //4
            "清除驱动器限位失败，请检查驱动器报警信息", //5
            "控制器PID加载失败", //6
            "控制器误差带设定失败", //7
            "示教器IO设定失败，请确认GlassRobot下ExtMdlCfg文件", //8
            "清零编码器位置失败", //9
            "控制器设置绝对位置失败", //10
            "运动控制器停止失败", //11
            "运动复位失败", //12
            "伺服使能失败，请清除驱动器报警重新使能", //13
            "伺服失能失败，请检查错误重新伺服失能", //14
            "", //15，
            "读取当前编码器位置失败，请检查串口或编码器错误", //16
            "读取轴状态失败", //17
            "PVT运动模式启动失败", //18
            "JOG运动模式启动失败", //19
            "PT运动模式启动失败", //20
            "JOG运动归零失败", //21
            "调用固高资源冲突", //22
            "", //23
            "", //24
            "", //25
            "", //26
            "", //27
            "", //28
            "", //29，保留扩展
            "", //30
            "", //31
            "", //32
            "", //33
            "", //34
            "", //35
            "", //36
            "", //37
            "", //38
            "", //39
            "" //40
        };
        //数学库错误代码和内容
        public static string[] errMsgofMath = new string[]
        {
            "一切正常",  //0
            "数学算法出错，目标点位不可达", //1
            "", //2
            "", //3
            "", //4
            "", //5
            "", //6
            "", //7
            "" //8
        };
        //IO错误代码和内容
        public static string[] errMsgofIO = new string[]
        {
            "一切正常",  //0
            "", //1
            "入口挡块气缸动作无法到位，请检测气缸动作及传感器", //2
            "分路器气缸动作无法到位，请检测气缸动作及传感器", //3
            "左转包器挡板气缸动作无法到位，请检测气缸动作及传感器", //4
            "右转包器挡板气缸动作无法到位，请检测气缸动作及传感器", //5
            "左压包缓冲挡板气缸动作无法到位，请检测气缸动作及传感器", //6
            "右压包缓冲挡板气缸动作无法到位，请检测气缸动作及传感器", //7
            "左推包器升降气缸动作无法到位，请检测气缸动作及传感器", //8
            "右推包器升降气缸动作无法到位，请检测气缸动作及传感器", //9
            "滑门上方压包气缸动作无法到位，请检测气缸动作及传感器", //10
            "栈板仓栈板横向支撑气缸动作无法到位，请检测气缸动作及传感器", //11
            "栈板仓栈板升降气缸动作无法到位，请检测气缸动作及传感器", //12
            "栈板仓输送线栈板换向支撑气缸动作无法到位，请检测气缸动作及传感器", //13
            "主垛下方栈板拦截挡板气缸动作无法到位，请检测气缸动作及传感器", //14
            "", //15，保留扩展
            "", //16
            "", //17
            "", //18
            "", //19
            "", //20
            "驱动器报警，请清除报警后运行", //21
            "跟随误差越限", //22
            "左推包器推包电机动作无法到位，请检测电机、变频器及行程传感器", //23
            "右推包器推包电机动作无法到位，请检测电机、变频器及行程传感器", //24
            "滑门左门电机动作无法到位，请检测电机、变频器及行程传感器", //25
            "滑门右门电机动作无法到位，请检测电机、变频器及行程传感器", //26
            "主垛升降电机动作无法到位，请检测电机、变频器及行程传感器", //27
            "数字量输出不正常，请检测控制器输出模块", //28
            "", //29，保留扩展
            "", //30
            "系统尚未自检，请先完成系统自检", //31
            "发生急停，请解除急停按钮并重新自检", //32
            "", //33
            "", //34
            "", //35
            "", //36
            "", //37
            "", //38
            "", //39
            "" //40
        };
        //界面错误代码和内容
        public static string[] errMsgofForm = new string[]
        {
            "一切正常",  //0
            "打开控制器失败，请重新启动", //1
            "控制器重置失败，请重新启动", //2
            "控制器配置失败，请确认GlassRobot下的GTS800文件", //3
            "清除驱动器报警或限位失败，请检查驱动器报警信息", //4
            "清除驱动器报警或限位失败，请检查驱动器报警信息", //5
            "控制器PID加载失败", //6
            "控制器误差带设定失败", //7
            "示教器IO设定失败，请确认GlassRobot下ExtMdlCfg文件", //8
            "清零编码器位置失败", //9
            "控制器设置绝对位置失败", //10
            "运动控制器停止失败", //11
            "运动复位失败", //12
            "伺服使能失败，请清除驱动器报警重新使能", //13
            "伺服失能失败，请检查错误重新伺服失能", //14
            "", //15，保留扩展
            "读取当前编码器位置失败，请检查串口或编码器错误", //16
            "读取轴状态失败", //17
            "PVT运动模式启动失败", //18
            "JOG运动模式启动失败", //19
            "", //20
            "JOG运动归零失败", //21
            "", //22
            "", //23
            "", //24
            "", //25
            "", //26
            "", //27
            "", //28
            "", //29，保留扩展
            "", //30
            "", //31
            "", //32
            "", //33
            "", //34
            "", //35
            "", //36
            "", //37
            "", //38
            "", //39
            "" //40
        };
    }
}
